package main

/**
|-------------------------------------------------------------------------------------------------
|	函数式编程案例
|	参数，返回值都可以是函数
|-------------------------------------------------------------------------------------------------
*/

import "fmt"

// 添加器
func adder() func(int) int {
	sum := 0	// 当前函数内的自由变量，return 的函数体内对 sum 的改变后的状态会被保存
	return func(v int) int {
		sum += v
		return sum
	}
}

func main() {
	a := adder()	// a 是 adder() 的返回值，使用 a 时需要向 a 中传递 int 类型的参数
	for i := 0; i < 10; i++ {
		fmt.Printf("0 + 1 + ... + %d = %d\n", i, a(i))
	}
}
